Repository: makinananya-cyber/HisaabWiseIOS
Catalog: HisaabWise/HisaabWise/Resources/Localizable.xcstrings
Source language: en
Languages: ar, hi

# reports.detail.wants.foot.over %@
source: That is %@ over the allowance for wants. Money for wants that gets spent has to come from somewhere — usually savings.
ar: هذا يتجاوز الحد المسموح للرغبات بمقدار %@. المال المصروف على الرغبات لا بد أن يأتي من مكان ما — غالبًا من المدخرات.
hi: यह इच्छाओं की अनुमत सीमा से %@ अधिक है। इच्छाओं पर खर्च होने वाला पैसा कहीं न कहीं से आना ही पड़ता है — आमतौर पर बचत से।

# reports.detail.wants.foot.within %@
source: That left %@ of the wants allowance unspent.
ar: بقي %@ من حد الرغبات دون صرف.
hi: इससे इच्छाओं की अनुमत सीमा में से %@ बिना खर्च के बचा रहा।

# reports.detail.wants.hint
source: Transport · fun · other
ar: المواصلات · الترفيه · أخرى
hi: परिवहन · मनोरंजन · अन्य

# reports.empty
source: No month has closed yet. Your first report arrives when this month ends.
ar: لم يُغلق أي شهر بعد. سيصلك أول تقرير عند انتهاء هذا الشهر.
hi: अभी तक कोई महीना बंद नहीं हुआ। इस महीने के समाप्त होने पर आपकी पहली रिपोर्ट आएगी।

# reports.hero.averageSpend
source: Avg. spend
ar: متوسط الصرف
hi: औसत खर्च

# reports.hero.caption
source: How close you got to your savings goal
ar: كم اقتربت من هدف ادخارك
hi: आप अपने बचत लक्ष्य के कितने करीब पहुँचे

# reports.hero.months
source: Months
ar: الأشهر
hi: महीने

# reports.hero.subtitle %@
source: %@ · the dashed line is the goal
ar: %@ · الخط المتقطّع هو الهدف
hi: %@ · बिंदीदार रेखा लक्ष्य है

# reports.hero.totalSaved
source: Total saved
ar: إجمالي المدَّخر
hi: कुल बचत

# reports.month.hint
source: Opens the month in full
ar: يفتح الشهر بالكامل
hi: महीने को पूरा खोलता है

# reports.month.spent %@
source: Spent %@
ar: صُرف %@
hi: %@ खर्च

# reports.title
source: Past spending reports
ar: تقارير الصرف السابقة
hi: पिछली खर्च रिपोर्ट

# reports.trend.accessibilityLabel
source: Savings goal reached each month
ar: هدف الادخار المُحقَّق كل شهر
hi: हर महीने पहुँचा गया बचत लक्ष्य

# reports.year.saved %@
source: %@ saved
ar: %@ مدَّخر
hi: %@ बचाया

# shell.logout.action
source: Log out
ar: تسجيل الخروج
hi: लॉग आउट

# shell.logout.confirm.cancel
source: Stay signed in
ar: البقاء مُسجَّل الدخول
hi: साइन इन रहें

# shell.logout.confirm.message
source: Your data stays safe. You'll need your password to sign back in.
ar: تبقى بياناتك آمنة. ستحتاج إلى كلمة مرورك لتسجيل الدخول مجددًا.
hi: आपका डेटा सुरक्षित रहता है। वापस साइन इन करने के लिए आपको अपने पासवर्ड की ज़रूरत होगी।

# shell.logout.confirm.title
source: Log out of HisaabWise?
ar: تسجيل الخروج من HisaabWise؟
hi: HisaabWise से लॉग आउट करें?

# shell.tab.account
source: Account
ar: الحساب
hi: खाता

# shell.tab.expenses
source: Expenses
ar: المصروفات
hi: खर्च

# shell.tab.home
source: Home
ar: الرئيسية
hi: होम

# shell.tab.learn
source: Learn
ar: تعلّم
hi: सीखें

# shell.tab.reports
source: Reports
ar: التقارير
hi: रिपोर्ट

# shell.unwritten.note
source: This screen is not built yet.
ar: لم تُبنَ هذه الشاشة بعد.
hi: यह स्क्रीन अभी नहीं बनी है।

# shell.verifyEmail
source: Check your inbox and verify your email address.
ar: تحقّق من بريدك الوارد وأكّد عنوان بريدك الإلكتروني.
hi: अपना इनबॉक्स जाँचें और अपना ईमेल पता सत्यापित करें।

# signin.action
source: Sign In
ar: تسجيل الدخول
hi: साइन इन करें

# signin.email.label
source: Email
ar: البريد الإلكتروني
hi: ईमेल

# signin.error.emailMissing
source: Please enter your email.
ar: يرجى إدخال بريدك الإلكتروني.
hi: कृपया अपना ईमेल दर्ज करें।

# signin.error.passwordMissing
source: Please enter your password.
ar: يرجى إدخال كلمة مرورك.
hi: कृपया अपना पासवर्ड दर्ज करें।

# signin.error.passwordTooShort
source: Use at least 8 characters.
ar: استخدم 8 أحرف على الأقل.
hi: कम से कम 8 वर्णों का उपयोग करें।

# signin.error.refused
source: That email and password do not match. Check both and try again.
ar: لا يتطابق البريد الإلكتروني وكلمة المرور. تحقّق منهما وحاول مرة أخرى.
hi: वह ईमेल और पासवर्ड मेल नहीं खाते। दोनों जाँचें और फिर से कोशिश करें।

# signin.error.support
source: Still not working? Contact support and we'll help you back in.
ar: ما زال لا يعمل؟ تواصل مع الدعم وسنساعدك على العودة.
hi: अब भी काम नहीं कर रहा? सहायता से संपर्क करें और हम आपको वापस अंदर आने में मदद करेंगे।

# signin.forgot
source: Forgot password?
ar: نسيت كلمة المرور؟
hi: पासवर्ड भूल गए?

# signin.keepSignedIn
source: Keep me signed in
ar: أبقني مُسجَّل الدخول
hi: मुझे साइन इन रखें

# signin.password.label
source: Password
ar: كلمة المرور
hi: पासवर्ड

# signin.pendingDeletion.action
source: Restore my account
ar: استعادة حسابي
hi: मेरा खाता पुनर्स्थापित करें

# signin.pendingDeletion.title
source: This account is scheduled for deletion.
ar: هذا الحساب مُجدوَل للحذف.
hi: यह खाता हटाने के लिए निर्धारित है।

# signin.register.action
source: Create an account
ar: إنشاء حساب
hi: खाता बनाएँ

# signin.register.prompt
source: Are you new here?
ar: هل أنت جديد هنا؟
hi: क्या आप यहाँ नए हैं?

# signin.subtitle
source: Sign in to pick up your spending, savings and streaks.
ar: سجّل الدخول لمتابعة صرفك ومدخراتك وسلاسلك.
hi: अपने खर्च, बचत और श्रृंखलाओं को जारी रखने के लिए साइन इन करें।

# signin.title.first
source: Welcome back.
ar: أهلًا بعودتك.
hi: वापसी पर स्वागत है।

# signin.title.second
source: Let's get you in.
ar: لندخلك إلى حسابك.
hi: आइए आपको अंदर ले चलें।

# state.failed.generic
source: Something went wrong. Try again.
ar: حدث خطأ ما. حاول مرة أخرى.
hi: कुछ गड़बड़ हो गई। फिर से कोशिश करें।

# state.failed.malformedResponse
source: We couldn't read the server's answer. Try again.
ar: تعذّر علينا قراءة رد الخادم. حاول مرة أخرى.
hi: हम सर्वर का उत्तर नहीं पढ़ सके। फिर से कोशिश करें।

# state.failed.monthClosed
source: That month has closed. Reload to see the current one.
ar: أُغلق ذلك الشهر. أعد التحميل لرؤية الشهر الحالي.
hi: वह महीना बंद हो गया है। वर्तमान महीना देखने के लिए फिर से लोड करें।

# state.failed.rateLimited
source: Too many tries. Wait a moment, then try again.
ar: محاولات كثيرة جدًا. انتظر لحظة ثم حاول مرة أخرى.
hi: बहुत अधिक प्रयास। एक क्षण रुकें, फिर से कोशिश करें।

# state.loading
source: Loading…
ar: جارٍ التحميل…
hi: लोड हो रहा है…

# state.offline
source: You're offline. Reconnect and we'll fetch your figures.
ar: أنت غير متصل. أعد الاتصال وسنجلب أرقامك.
hi: आप ऑफ़लाइन हैं। फिर से कनेक्ट करें और हम आपके आँकड़े ले आएँगे।

# state.retry
source: Try again
ar: حاول مرة أخرى
hi: फिर से कोशिश करें
